{"raw_case_num": "2017_HKCT_1", "date": "2017-03-28T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2017] HKCT 1", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000001_2017.doc", "cases_title": "COMPETITION COMMISSION V. NUTANIX HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2017", "date_in_content": "Date of Application: 23 March 2017 Date of Decision: 28 March 2017", "coram": "Before: Hon G. Lam J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and NUTANIX HONG KONG LIMITED 1st Respondent BT HONG KONG LIMITED 2nd Respondent SIS INTERNATIONAL LIMITED 3rd Respondent INNOVIX \n\t\t\t\tDISTRIBUTION LIMITED (trading as “INNOVIX DISTRIBUTION”) 4th \n\t\t\t\tRespondent TECH‑21 SYSTEMS LIMITED 5th Respondent ____________", "representation": "Written submission by Winston & Strawn for the Applicant"}
{"raw_case_num": "2017_HKCT_2", "date": "2017-06-12T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2017] HKCT 2", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000001A_2017.doc", "cases_title": "COMPETITION COMMISSION V. NUTANIX HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2017", "date_in_content": "Date of Hearing: 26 May 2017 Date of Decision: 26 May 2017 Date of Reasons for Decision: 12 June 2017", "coram": "Before: Hon G Lam J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and NUTANIX HONG KONG LIMITED 1st Respondent BT HONG KONG LIMITED 2nd Respondent SIS INTERNATIONAL LIMITED 3rd Respondent INNOVIX DISTRIBUTION LIMITED 4th Respondent (trading as “INNOVIX DISTRIBUTION”) TECH‑21 SYSTEMS LIMITED 5th Respondent", "representation": "Ms Catrina Lam, instructed by Winston & Strawn, for the Applicant Mr Matthew Gearing, Solicitor advocate, instructed by Latham & Watkins, for the 1 st Respondent Mr Stephen Crosswell of Baker & McKenzie, for the 2 nd Respondent Mr Alfred Wu of Norton Rose Fulbright Hong Kong, for the 3 rd Respondent Ms Eva Sit, instructed by Linklaters, for the 4 th Respondent Ms Cindy Kong, instructed by FONGS, for the 5 th Respondent"}
{"raw_case_num": "2018_HKCT_3", "date": "2018-07-31T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2018] HKCT 3", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000001D_2017.docx", "cases_title": "COMPETITION COMMISSION V. NUTANIX HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2017", "date_in_content": "Date of Written Submissions: 4, 18 and 19 April 2018 Date of Decision on Costs: 31 July 2018", "coram": "Before: Hon G Lam J, President of the Competition Tribunal, in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and NUTANIX HONG KONG LIMITED 1st Respondent BT HONG KONG LIMITED 2nd Respondent SIS INTERNATIONAL LIMITED 3rd Respondent INNOVIX DISTRIBUTION LIMITED 4th Respondent (trading as “INNOVIX DISTRIBUTION”) TECH‑21 SYSTEMS LIMITED 5th Respondent", "representation": "Mr Johnny Mok SC and Ms Catrina Lam, instructed by Winston & Strawn, for the Applicant Mr Gerard McCoy SC and Mr Timothy Parker, instructed by Norton Rose Fulbright Hong Kong, for the 3 rd Respondent"}
{"raw_case_num": "2018_HKCT_2", "date": "2018-07-10T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2018] HKCT 2", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000002_2017.doc", "cases_title": "COMPETITION COMMISSION V. W. HING CONSTRUCTION CO LTD AND OTHERS", "cases_act": "CTEA2/2017", "date_in_content": "Date of Hearing: 10 July 2018 Date of Decision: 10 July 2018", "coram": "Before: Hon G Lam J in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and W. HING CONSTRUCTION COMPANY LIMITED 1 st Respondent (永興聯合建築有限公司) SUN SPARK CONSTRUCTION LIMITED (裕輝建築有限公司) 2 nd Respondent LAU CHUNG YAN (劉頌欣) and LAU CHUN KWOK ADAM (劉鎮國) (in partnership trading as MAU HANG PAINTING & DECORATION CO (茂恒油漆裝飾公司)) 3 rd Respondent CHEUNG YIU FAI DANNY (張耀輝) and WONG TUNG HOI (黃東海) (in partnership trading as TAI DOU BUILDING CONTRACTOR (大道建築公司)) 4 th Respondent KAM KEE MACHINE ELECTRICAL IRON WORKS COMPANY LIMITED (金記機電鐵器工程有限公司) 5 th Respondent HUI TAK CHEONG KANLY (許德昌) and HUI TAK ON BRYAN (許德安) (in partnership trading as HIP YICK CONSTRUCTION COMPANY (協益建築公司)) 6 th Respondent SUEN SIK KAU (孫錫球) (trading as TAI WAH CIVIL ENGINEERING (泰華土木工程)) 7 th Respondent POON WAI WOON (潘維桓) and POON KAI WO JULIO (潘啟和) (in partnership trading as WAI SUN IRON & DECORATION CO (維新鐵器裝修公司)) 8 th Respondent YEUNG KWOK YEE (楊國儀) (trading as WIDE PROJECT ENGINEERING & CONSTRUCTION CO (百達建築工程公司)) 9 th Respondent LUEN HOP DECORATION ENGINEERING CO LIMITED (聯合裝飾工程有限公司) 10 th Respondent", "representation": "Mr Byron Chiu, instructed by King & Wood Mallesons, for the Applicant Mr Carter Chim, instructed by JCC Cheung & Co, for the 2 nd to the 4 th Respondents Ms Allison Wong, instructed by JCC Cheung & Co, for the 5 th Respondent Mr Richard Yip, instructed by JCC Cheung & Co, for the 6 th to 8 th and 10 th Respondents The 1 st and 9 th Respondents did not appear"}
{"raw_case_num": "2018_HKCT_4", "date": "2018-09-12T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2018] HKCT 4", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2018/CTA000001_2018.docx", "cases_title": "TACHING PETROLEUM CO LTD V. MEYER ALUMINIUM LTD", "cases_act": "CTA1/2018", "date_in_content": "Date of Hearing: 7 September 2018 Date of Decision: 7 September 2018 Date of Reasons for Decision: 12 September 2018", "coram": "Before: Hon Au-Yeung J in Chambers", "parties": "BETWEEN TACHING PETROLEUM COMPANY LIMITED Plaintiff and MEYER ALUMINIUM LIMITED Defendant and SHELL HONG KONG LIMITED Intended Intervener", "representation": "Ms Catrina Lam and Ms Cherry Xu, instructed by Herbert Tsoi & Partners, for Taching, the Plaintiff in CTA 1/2018 and HCA 1929/2017 Mr Kenneth K H Lee and Ms Nana Lui, instructed by Robertsons, for Meyer, the Defendant in all cases Ms Eva Sit, instructed by Clifford Chance, for Shell, the Intended Intervener in CTA 1/2018 and the Plaintiff in HCA 1069/2018"}
{"raw_case_num": "2017_HKCT_3", "date": "2017-10-03T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2017] HKCT 3", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000001B_2017.doc", "cases_title": "COMPETITION COMMISSION V. NUTANIX HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2017", "date_in_content": "Date of Hearing: 18 September 2017 Date of Decision: 3 October 2017", "coram": "Before: Hon G Lam J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and NUTANIX HONG KONG LIMITED 1st Respondent BT HONG KONG LIMITED 2nd Respondent SIS INTERNATIONAL LIMITED 3rd Respondent INNOVIX DISTRIBUTION LIMITED 4th Respondent (trading as “INNOVIX DISTRIBUTION”) TECH‑21 SYSTEMS LIMITED 5th Respondent", "representation": "Mr Johnny Mok SC and Ms Catrina Lam, instructed by Winston & Strawn, for the Applicant Mr Matthew Gearing, Solicitor advocate, instructed by Latham & Watkins, for the 1 st Respondent Mr Charles Hollander, instructed by Baker & McKenzie, for the 2 nd Respondent Mr Alfred Wu, of Norton Rose Fulbright Hong Kong, for the 3 rd Respondent Mr Joshua Chan, instructed by Linklaters, for the 4 th Respondent Ms Cindy Kong, instructed by FONGS, for the 5 th Respondent"}
{"raw_case_num": "2018_HKCT_1", "date": "2018-03-14T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2018] HKCT 1", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000001C_2017.docx", "cases_title": "COMPETITION COMMISSION V. NUTANIX HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2017", "date_in_content": "Date of Hearing: 9 February 2018 Date of Decision: 14 March 2018", "coram": "Before: Hon G. Lam J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and NUTANIX HONG KONG LIMITED 1 st Respondent BT HONG KONG LIMITED 2 nd Respondent SIS INTERNATIONAL LIMITED 3 rd Respondent INNOVIX DISTRIBUTION LIMITED 4 th Respondent (trading as “INNOVIX DISTRIBUTION”) TECH‑21 SYSTEMS LIMITED 5 th Respondent", "representation": "Mr Johnny Mok SC and Ms Catrina Lam, instructed by Winston & Strawn, for the Applicant Mr Gerard McCoy SC and Mr Timothy Parker, instructed by Norton Rose Fulbright Hong Kong, for the 3 rd Respondent"}
{"raw_case_num": "2018_HKCT_6", "date": "2018-10-31T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2018] HKCT 6", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000002B_2017.docx", "cases_title": "COMPETITION COMMISSION V. W. HING CONSTRUCTION CO LTD AND OTHERS", "cases_act": "CTEA2/2017", "date_in_content": "Date of Hearing: 2 October 2018 Date of Decision: 2 October 2018 Date of Reasons for Decision: 31 October 2018", "coram": "Before: Hon G Lam J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and W. HING CONSTRUCTION COMPANY LIMITED 1 st Respondent (永興聯合建築有限公司) SUN SPARK CONSTRUCTION LIMITED 2 nd Respondent (裕輝建築有限公司) LAU CHUNG YAN (劉頌欣) and LAU CHUN KWOK 3 rd Respondent ADAM (劉鎮國) (in partnership trading as MAU HANG PAINTING & DECORATION CO (茂恒油漆裝飾公司)) CHEUNG YIU FAI DANNY (張耀輝) and WONG 4 th Respondent TUNG HOI (黃東海) (in partnership trading as TAI DOU BUILDING CONTRACTOR (大道建築公司)) KAM KEE MACHINE ELECTRICAL IRON WORKS 5 th Respondent COMPANY LIMITED (金記機電鐵器工程有限公司) HUI TAK CHEONG KANLY (許德昌) and HUI TAK 6 th Respondent ON BRYAN (許德安) (in partnership trading as HIP YICK CONSTRUCTION COMPANY (協益建築公司)) SUEN SIK KAU (孫錫球) (trading as TAI WAH CIVIL 7 th Respondent ENGINEERING (泰華土木工程)) POON WAI WOON (潘維桓) and POON KAI WO 8 th Respondent JULIO (潘啟和) (in partnership trading as WAI SUN IRON & DECORATION CO (維新鐵器裝修公司)) YEUNG KWOK YEE (楊國儀) (trading as WIDE PROJECT ENGINEERING & CONSTRUCTION CO 9 th Respondent (百達建築工程公司)) LUEN HOP DECORATION ENGINEERING CO 10 th Respondent LIMITED (聯合裝飾工程有限公司)", "representation": "Mr Abraham Chan SC and Mr Byron Chiu, instructed by King & Wood Mallesons, for the Applicant Mr Harrison Cheung, instructed by Wong & Lawyers, for the 1 st Respondent Mr Carter Chim, instructed by JCC Cheung & Co, for the 2 nd and 3 rd Respondents Mr Peter Dong, instructed by Henry Wan & Yeung, for the 4 th Respondent Mr Anson Wong Yu Yat, instructed by JCC Cheung & Co, for the 5 th Respondent Mr Richard Yip, instructed by JCC Cheung & Co, for the 6 th , 7 th , 8 th and 10 th Respondents Ms Connie Lee and Mr Tommy Cheung, instructed by Benjamin Au & Nilly Chan, Solicitors, for the 9 th Respondent"}
{"raw_case_num": "2018_HKCT_5", "date": "2018-09-28T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2018] HKCT 5", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000002A_2017.docx", "cases_title": "COMPETITION COMMISSION V. W. HING CONSTRUCTION CO LTD AND OTHERS", "cases_act": "CTEA2/2017", "date_in_content": "Date of Hearing: 26 September 2018 Date of Decision: 26 September 2018 Date of Reasons for Decision: 28 September 2018", "coram": "Before: Hon G Lam J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and W. HING CONSTRUCTION COMPANY LIMITED (永興聯合建築有限公司) 1st Respondent SUN SPARK CONSTRUCTION LIMITED (裕輝建築有限公司) 2nd Respondent LAU CHUNG YAN (劉頌欣) and LAU CHUN KWOK ADAM (劉鎮國) (in partnership trading as MAU HANG PAINTING & DECORATION CO (茂恒油漆裝飾公司)) 3rd Respondent CHEUNG YIU FAI DANNY (張耀輝) and WONG TUNG HOI (黃東海) (in partnership trading as TAI DOU BUILDING CONTRACTOR (大道建築公司)) 4th Respondent KAM KEE MACHINE ELECTRICAL IRON WORKS 5th Respondent COMPANY LIMITED (金記機電鐵器工程有限公司) HUI TAK CHEONG KANLY (許德昌) and HUI TAK ON BRYAN (許德安) (in partnership trading as HIP YICK CONSTRUCTION COMPANY (協益建築公司)) 6th Respondent SUEN SIK KAU (孫錫球) (trading as TAI WAH CIVIL ENGINEERING (泰華土木工程)) 7th Respondent POON WAI WOON (潘維桓) and POON KAI WO JULIO (潘啟和) (in partnership trading as WAI SUN IRON & DECORATION CO (維新鐵器裝修公司)) 8th Respondent YEUNG KWOK YEE (楊國儀) (trading as WIDE  PROJECT ENGINEERING & CONSTRUCTION CO (百達建築工程公司)) 9 th Respondent LUEN HOP DECORATION ENGINEERING CO LIMITED (聯合裝飾工程有限公司) 10th Respondent", "representation": "Mr Abraham Chan SC and Mr Byron Chiu, instructed by King & Wood Mallesons, for the Commission (the Applicant) Mr Carter Chim and Mr Thomas WK Wong, instructed by JCC Cheung & Co, for the 2 nd -3 rd Respondents Mr Peter Dong, instructed by Henry Wan & Yeung, for the 4 th Respondent Mr Hectar Pun SC, Mr Anson Wong Yu Yat and Ms Allison Wong, instructed by JCC Cheung & Co, for the 5 th Respondent Mr Richard Yip, instructed by JCC Cheung & Co, for the 6 th -8 th and 10 th Respondents The 1 st and 9 th Respondents did not appear"}
{"raw_case_num": "2020_HKCT_5", "date": "2020-07-17T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2020] HKCT 5", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2019/CTEA000001A_2019.docx", "cases_title": "COMPETITION COMMISSION V. FUNGS E&M ENGINEERING CO LTD", "cases_act": "CTEA1/2019", "date_in_content": "Date of Hearing: 26 June 2020 Date of Decision (No. 1): 17 July 2020", "coram": "Before: Hon Au-Yeung J, Deputy President in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and FUNGS E&M ENGINEERING COMPANY 1st Respondent LIMITED (馮氏機電工程有限公司) YEE HING METAL SHOP 2nd Respondent (義興鐵器土木油漆工程) CHEUNG MIN (張棉) trading as ACCORD 3rd Respondent CONSTRUCTION & DECORATION CO (雅閣建築裝修工程公司) HING SHING CONSTRUCTION 4th Respondent COMPANY (興盛建築公司) LUEN HOP DECORATION 5th Respondent ENGINEERING COMPANY LIMITED (聯合裝飾工程有限公司) DAO KEE CONSTRUCTION COMPANY 6th Respondent LIMITED (陶記營造廠有限公司) WONG WAI CHUEN (黃偉銓) 7th Respondent WONG FU SAN (黃富新) 8th Respondent CHEUNG YUN KAM (張潤錦) 9th Respondent", "representation": "Mr Jonathan Wong, instructed by King & Wood Mallesons, for the Applicant Mr Matthew Ngai and Ms Mandy Chan, instructed by Dundons Solicitors, for the 1 st Respondent The 2 nd , 3 rd , 8 th and 9 th Respondents appeared in person Mr W K Ng, of Lui & Law, for the 4 th , 6 th and 7 th Respondents Written submission by Mr Harrison Cheung, instructed by Lui & Law, for the 4 th , 6 th and 7 th Respondents The 5 th Respondent was not represented and did not appear"}
{"raw_case_num": "2019_HKCT_1", "date": "2019-02-22T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2019] HKCT 1", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2018/CTA000001A_2018.docx", "cases_title": "TACHING PETROLEUM COMPANY LTD V. MEYER ALUMINIUM LTD", "cases_act": "CTA1/2018", "date_in_content": "Date of Hearing: 21 January 2019 Date of Decision: 22 February 2019", "coram": "Before: Hon Au-Yeung J, Deputy President of the Competition Tribunal in Chambers", "parties": "BETWEEN TACHING PETROLEUM COMPANY LIMITED Plaintiff and MEYER ALUMINIUM LIMITED Defendant", "representation": "Ms Catrina Lam and Ms Cherry Xu, instructed by Herbert Tsoi & Partners, for Taching, the plaintiff in CTA 1/2018 Ms Eva Sit and Mr Joshua Chan, instructed by Clifford Chance, for Shell, the plaintiff in CTA 2/2018 Mr Kenneth K H Lee and Ms Nana Lui, instructed by Robertsons, for Meyer, the defendant in both cases"}
{"raw_case_num": "2020_HKCT_2", "date": "2020-05-29T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2020] HKCT 2", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2018/CTA000001B_2018.docx", "cases_title": "TACHING PETROLEUM CO LTD V. MEYER ALUMINIUM LTD", "cases_act": "CTA1/2018", "date_in_content": "Dates of Hearing: 10 and 16 January 2020 Date of Decision: 29 May 2020", "coram": "Before: Hon Au-Yeung J, Deputy President in Chambers", "parties": "BETWEEN TACHING PETROLEUM COMPANY LIMITED Plaintiff and MEYER ALUMINIUM LIMITED Defendant", "representation": "Ms Catrina Lam (on 10 January 2020 only) and Ms Cherry Xu, instructed by Herbert Tsoi & Partners, for Taching, the plaintiff in CTA 1/2018 Ms Eva Sit, SC and Mr Joshua Chan (on 10 January 2020 only), instructed by Clifford Chance, for Shell, the plaintiff in CTA 2/2018 Mr Kenneth K H Lee and Ms Nana Lui and Mr William Tse, instructed by Robertsons, for Meyer, the defendant in both cases"}
{"raw_case_num": "2020_HKCT_1", "date": "2020-04-29T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2020] HKCT 1", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000002D_2017.docx", "cases_title": "COMPETITION COMMISSION V. W. HING CONSTRUCTION CO LTD AND OTHERS", "cases_act": "CTEA2/2017", "date_in_content": "Dates of Hearing: 14-16 January 2020 Date of Judgment: 29 April 2020", "coram": "Before: Hon G Lam J, President of the Competition Tribunal", "parties": "BETWEEN COMPETITION COMMISSION Applicant and W. HING CONSTRUCTION COMPANY LIMITED (永興聯合建築有限公司) 1 st Respondent SUN SPARK CONSTRUCTION LIMITED (裕輝建築有限公司) 2 nd Respondent LAU CHUNG YAN (劉頌欣) and LAU CHUN KWOK ADAM (劉鎮國) (in partnership trading as MAU HANG PAINTING & DECORATION CO (茂恒油漆裝飾公司)) 3 rd Respondent CHEUNG YIU FAI DANNY (張耀輝) and WONG TUNG HOI (黃東海) (in partnership trading as TAI DOU BUILDING CONTRACTOR (大道建築公司)) 4 th Respondent KAM KEE MACHINE ELECTRICAL IRON WORKS COMPANY LIMITED (金記機電鐵器工程有限公司) 5 th Respondent HUI TAK CHEONG KANLY (許德昌) and HUI TAK ON BRYAN (許德安) (in partnership trading as HIP YICK CONSTRUCTION COMPANY (協益建築公司)) 6 th Respondent SUEN SIK KAU (孫錫球) (trading as TAI WAH CIVIL ENGINEERING (泰華土木工程)) 7 th Respondent POON WAI WOON (潘維桓) and POON KAI WO JULIO (潘啟和) (in partnership trading as WAI SUN IRON & DECORATION CO (維新鐵器裝修公司)) 8 th Respondent YEUNG KWOK YEE (楊國儀) (trading as WIDE PROJECT ENGINEERING & CONSTRUCTION CO (百達建築工程公司)) 9 th Respondent LUEN HOP DECORATION ENGINEERING CO LIMITED (聯合裝飾工程有限公司) 10 th Respondent", "representation": "Mr Daniel Beard QC, Mr Abraham Chan SC and Mr Byron Chiu, instructed by King & Wood Mallesons, for the Applicant Mr Harrison Cheung, instructed by Wong & Lawyers, for the 1 st Respondent Mr Carter Chim and Ms Joyce YY Kwok, instructed by JCC Cheung & Co, for the 2 nd and 3 rd Respondents Ms Sharon Ng, instructed by Bryan Chan & Co, for the 4 th Respondent Mr Hectar Pun SC, Mr Anson Wong Yu Yat and Ms Allison Wong, instructed by JCC Cheung & Co, for the 5 th Respondent Mr Richard Yip and Ms Tara Liao, instructed by JCC Cheung & Co, for the 6 th , 7 th , 8 th and 10 th Respondents Ms Connie Lee and Mr Tommy Cheung, instructed by Benjamin Au & Billy Chan, Solicitors, for the 9 th Respondent"}
{"raw_case_num": "2020_HKCT_6", "date": "2020-07-28T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2020] HKCT 6", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000002E_2017.docx", "cases_title": "COMPETITION COMMISSION V. W. HING CONSTRUCTION CO LTD", "cases_act": "CTEA2/2017", "date_in_content": "Dates of Written Submissions: 4, 16 and 23 June 2020 Date of Decision: 28 July 2020", "coram": "Before: Hon G Lam J, President of the Competition Tribunal", "parties": "BETWEEN COMPETITION COMMISSION Applicant and W. HING CONSTRUCTION COMPANY LIMITED (永興聯合建築有限公司) 1 st Respondent SUN SPARK CONSTRUCTION LIMITED (裕輝建築有限公司) 2 nd Respondent LAU CHUNG YAN (劉頌欣) and LAU CHUN KWOK ADAM (劉鎮國) (in partnership trading as MAU HANG PAINTING & DECORATION CO (茂恒油漆裝飾公司)) 3 rd Respondent CHEUNG YIU FAI DANNY (張耀輝) and WONG TUNG HOI (黃東海) (in partnership trading as TAI DOU BUILDING CONTRACTOR (大道建築公司)) 4 th Respondent KAM KEE MACHINE ELECTRICAL IRON WORKS COMPANY LIMITED (金記機電鐵器工程有限公司) 5 th Respondent HUI TAK CHEONG KANLY (許德昌) and HUI TAK ON BRYAN (許德安) (in partnership trading as HIP YICK CONSTRUCTION COMPANY (協益建築公司)) 6 th Respondent SUEN SIK KAU (孫錫球) (trading as TAI WAH CIVIL ENGINEERING (泰華土木工程)) 7 th Respondent POON WAI WOON (潘維桓) and POON KAI WO JULIO (潘啟和) (in partnership trading as WAI SUN IRON & DECORATION CO (維新鐵器裝修公司)) 8 th Respondent YEUNG KWOK YEE (楊國儀) (trading as WIDE PROJECT ENGINEERING & CONSTRUCTION CO (百達建築工程公司)) 9 th Respondent LUEN HOP DECORATION ENGINEERING CO LIMITED (聯合裝飾工程有限公司) 10 th Respondent", "representation": "Written Submissions by Mr Abraham Chan SC and Mr Byron Chiu, instructed by King & Wood Mallesons, for the Applicant Written Submissions by the 3 rd , 5 th , 6 th , 7 th and 8 th Respondents, unrepresented No written submissions by the 2 nd and 10 th Respondents, unrepresented"}
{"raw_case_num": "2020_HKCT_4", "date": "2020-07-17T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2020] HKCT 4", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2019/CTEA000001_2019.docx", "cases_title": "COMPETITION COMMISSION V. FUNGS E&M ENGINEERING CO LTD", "cases_act": "CTEA1/2019", "date_in_content": "Date of Hearing: 26 June 2020 Date of Decision (No. 2): 17 July 2020", "coram": "Before: Hon Au-Yeung J, Deputy President in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and FUNGS E&M ENGINEERING COMPANY 1st Respondent LIMITED (馮氏機電工程有限公司) YEE HING METAL SHOP 2nd Respondent (義興鐵器土木油漆工程) CHEUNG MIN (張棉) trading as ACCORD 3rd Respondent CONSTRUCTION & DECORATION CO (雅閣建築裝修工程公司) HING SHING CONSTRUCTION 4th Respondent COMPANY (興盛建築公司) LUEN HOP DECORATION 5th Respondent ENGINEERING COMPANY LIMITED (聯合裝飾工程有限公司) DAO KEE CONSTRUCTION COMPANY 6th Respondent LIMITED (陶記營造廠有限公司) WONG WAI CHUEN (黃偉銓) 7th Respondent WONG FU SAN (黃富新) 8th Respondent CHEUNG YUN KAM (張潤錦) 9th Respondent and PAU WAI LIN (鮑惠蓮) Intended Third Party", "representation": "Mr Jonathan Wong, instructed by King & Wood Mallesons, for the Applicant Mr Matthew Ngai and Ms Mandy Chan, instructed by Dundons Solicitors, for the 1 st Respondent The 2 nd , 3 rd , 8 th and 9 th Respondents appeared in person Attendance of Lui & Law for the 4 th , 6 th and 7 th Respondents was excused The 5 th Respondent was not represented and did not appear"}
{"raw_case_num": "2020_HKCT_7", "date": "2020-08-27T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2020] HKCT 7", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2018/CTA000001C_2018.docx", "cases_title": "TACHING PETROLEUM CO LTD V. MEYER ALUMINIUM LTD", "cases_act": "CTA1/2018", "date_in_content": "Closing Date for Written Submission: 10 August 2020 Date of Decision: 27 August 2020", "coram": "Before: Hon Au-Yeung J, Deputy President in Chambers", "parties": "TACHING PETROLEUM COMPANY LIMITED Plaintiff and MEYER ALUMINIUM LIMITED Defendant", "representation": "Ms Catrina Lam and Ms Cherry Xu, instructed by Herbert Tsoi & Partners, for Taching, the plaintiff in CTA 1/2018 Ms Eva Sit, SC and Mr Joshua Chan, instructed by Clifford Chance, for Shell, the plaintiff in CTA 2/2018 Mr Kenneth K H Lee and Ms Nana Lui and Mr William Tse, instructed by Robertsons, for Meyer, the defendant in both cases"}
{"raw_case_num": "2020_HKCT_3", "date": "2020-07-17T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2020] HKCT 3", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2018/CTEA000001_2018.docx", "cases_title": "COMPETITION COMMISSION V. KAM KWONG ENGINEERING COMPANY LTD AND OTHERS", "cases_act": "CTEA1/2018", "date_in_content": "Dates of Hearing: 3 June 2020 Date of Decision: 3 June 2020 Date of Reasons for Decision: 17 July 2020", "coram": "Before: Hon Harris J in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and KAM KWONG ENGINEERING COMPANY LTD 1st Respondent (金光工程有限公司) GOLDFIELD N&W CONSTRUCTION 2nd Respondent COMPANY LTD (聯合金輝建築工程有限公司) PACIFIC VIEW ENGINEERING LTD 3rd Respondent (豪景工程有限公司) CHAN KAM SHUI (陳金水) 4th Respondent LAM PO WONG (林保旺) 5th Respondent", "representation": "Mr Victor Dawes SC, Mr Issac Chan and Mr Adrian TY Wong, instructed by King & Wood Mallesons, for the applicant Ms Allison Wong, instructed by JCC Cheung & Co, for the 1 st and 4 th respondents Mr Michael Lok and Ms Sharon Yuen, instructed by Chow & Partners, for the 2 nd respondent Mr Matthew Ngai, instructed by Dundons, for the 3 rd and 5 th respondents<"}
{"raw_case_num": "2019_HKCT_3", "date": "2019-05-17T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2019] HKCT 3", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000002C_2017.docx", "cases_title": "COMPETITION COMMISSION V. W. HING CONSTRUCTION CO LTD AND OTHERS", "cases_act": "CTEA2/2017", "date_in_content": "Dates of Hearing: 26-30 November and 3-6, 10-13, 18-21 December 2018 Date of Judgment: 17 May 2019", "coram": "Before: Hon G Lam J, President of the Competition Tribunal", "parties": "BETWEEN COMPETITION COMMISSION Applicant and W. HING CONSTRUCTION COMPANY LIMITED 1 st Respondent (永興聯合建築有限公司) SUN SPARK CONSTRUCTION LIMITED 2 nd Respondent (裕輝建築有限公司) LAU CHUNG YAN (劉頌欣) and LAU CHUN KWOK 3 rd Respondent ADAM (劉鎮國) (in partnership trading as MAU HANG PAINTING & DECORATION CO (茂恒油漆裝飾公司)) CHEUNG YIU FAI DANNY (張耀輝) and WONG 4 th Respondent TUNG HOI (黃東海) (in partnership trading as TAI DOU BUILDING CONTRACTOR (大道建築公司)) KAM KEE MACHINE ELECTRICAL IRON WORKS 5 th Respondent COMPANY LIMITED (金記機電鐵器工程有限公司) HUI TAK CHEONG KANLY (許德昌) and HUI TAK 6 th Respondent ON BRYAN (許德安) (in partnership trading as HIP YICK CONSTRUCTION COMPANY (協益建築公司)) SUEN SIK KAU (孫錫球) (trading as TAI WAH CIVIL 7 th Respondent ENGINEERING (泰華土木工程)) POON WAI WOON (潘維桓) and POON KAI WO 8 th Respondent JULIO (潘啟和) (in partnership trading as WAI SUN IRON & DECORATION CO (維新鐵器裝修公司)) YEUNG KWOK YEE (楊國儀) (trading as WIDE 9 th Respondent PROJECT ENGINEERING & CONSTRUCTION CO (百達建築工程公司)) LUEN HOP DECORATION ENGINEERING CO 10 th Respondent LIMITED (聯合裝飾工程有限公司)", "representation": "Mr Daniel Beard QC, Mr Abraham Chan SC and Mr Byron Chiu, instructed by King & Wood Mallesons, for the Applicant Mr Harrison Cheung, instructed by Wong & Lawyers, for the 1 st Respondent Mr Carter Chim, Mr Thomas WK Wong and Ms Joyce YY Kwok, instructed by JCC Cheung & Co, for the 2 nd and 3 rd Respondents Ms Sharon Ng, instructed by Henry Wan & Yeung, for the 4 th Respondent Mr Hectar Pun SC (on 18-20 December 2018 only), Mr Anson Wong Yu Yat and Ms Allison Wong, instructed by JCC Cheung & Co, for the 5 th Respondent Mr Richard Yip and Ms Tara Liao, instructed by JCC Cheung & Co, for the 6 th , 7 th , 8 th and 10 th Respondents Ms Connie Lee and Mr Tommy Cheung, instructed by Benjamin Au & Billy Chan, Solicitors, for the 9 th Respondent"}
{"raw_case_num": "2020_HKCT_10", "date": "2020-11-03T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2020] HKCT 10", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2020/CTEA000001_2020.docx", "cases_title": "COMPETITION COMMISSION V. QUANTR LTD AND ANOTHER", "cases_act": "CTEA1/2020", "date_in_content": "Date of Judgment: 3 November 2020", "coram": "Before: Hon Linda Chan J", "parties": "BETWEEN COMPETITION COMMISSION Applicant and QUANTR LIMITED 1 st Respondent CHEUNG MAN KIT 2 nd Respondent", "representation": "MinterEllison LLP, solicitors for the applicant Humphrey & Associates, solicitors for the 1 st and 2 nd respondents"}
{"raw_case_num": "2020_HKCT_12", "date": "2020-12-31T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2020] HKCT 12", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2020/CTEA000002_2020.docx", "cases_title": "COMPETITION COMMISSION V. T.H. LEE BOOK CO LTD AND OTHERS", "cases_act": "CTEA2/2020", "date_in_content": "Date of Hearing: 30 November 2020 Dates of supplementary written submissions: 7 and 14 December 2020 Date of Decision: 31 December 2020", "coram": "Before: Hon G Lam J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and T.H. LEE BOOK COMPANY LIMITED 1 st Respondent THE COMMERCIAL PRESS (HONG KONG) LIMITED 2 nd Respondent SINO UNITED PUBLISHING (HOLDINGS) LIMITED 3 rd Respondent HUI CHIU MING 4 th Respondent", "representation": "Mr Jonathan Chang SC (written submissions only), Mr Peter Dong, instructed by Woo Kwan Lee & Lo, for the Applicant Ms Maggie Wong SC (written submissions only), Mr Kenneth K H Lee and Ms Emily Y Ting, instructed by C L Chow & Macksion Chan, for the 1 st and 4 th Respondents Mr Abraham Chan SC and Mr Carter Chim, instructed by Deacons, for the 2 nd and 3 rd Respondents"}
{"raw_case_num": "2021_HKCT_3", "date": "2021-10-07T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2021] HKCT 3", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2020/CTEA000003_2020.docx", "cases_title": "COMPETITION COMMISSION V. LINDE HKO LTD AND OTHERS", "cases_act": "CTEA3/2020", "date_in_content": "Dates of Hearing: 7 October 2021 Date of Decision: 7 October 2021", "coram": "Before: Hon Harris J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and LINDE HKO LIMITED 1 st Respondent TSE CHUN WAH 2 nd Respondent LINDE GMBH 3 rd Respondent", "representation": "Mr Jin Pao SC and Mr Timothy Parker, instructed by Eversheds Sutherland, for the applicant Ms Eva Sit SC and Mr Joshua Chan, instructed by Linklaters, for the 1 st respondent Mr Nigel Francis, of YTL LLP, for the 2 nd respondent Mr Carter Chim, instructed by Linklaters, for the 3 rd respondent"}
{"raw_case_num": "2020_HKCT_11", "date": "2020-12-16T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2020] HKCT 11", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000001F_2017.docx", "cases_title": "COMPETITION COMMISSION V. NUTANIX HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2017", "date_in_content": "Dates of Written Submissions: 1 and 8 December 2020 Date of Judgment: 16 December 2020", "coram": "Before: Hon G Lam J, President of the Competition Tribunal in Court", "parties": "BETWEEN COMPETITION COMMISSION Applicant and NUTANIX HONG KONG LIMITED 1 st Respondent BT HONG KONG LIMITED 2 nd Respondent SIS INTERNATIONAL LIMITED 3 rd Respondent INNOVIX DISTRIBUTION LIMITED 4 th Respondent (trading as “INNOVIX DISTRIBUTION”) TECH‑21 SYSTEMS LIMITED 5 th Respondent", "representation": "Written submissions by Mr Mark Hoskins QC and Ms Catrina Lam, instructed by Winston & Strawn, for the Applicant Letter by Latham & Watkins, for the 1 st Respondent Written Submissions by Mr Stephen Crosswell, Solicitor Advocate, of Baker McKenzie, for the 2 nd Respondent Letter by Linklaters, for the 4 th Respondent The 5 th Respondent did not submit any letter or written submissions"}
{"raw_case_num": "2019_HKCT_2", "date": "2019-05-17T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2019] HKCT 2", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2017/CTEA000001E_2017.docx", "cases_title": "COMPETITION COMMISSION V. NUTANIX HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2017", "date_in_content": "Dates of Hearing: 20-22, 25-29 June, 3 July, 17-20 September 2018 Date of Judgment: 17 May 2019", "coram": "Before: Hon G. Lam J, President of the Competition Tribunal", "parties": "BETWEEN COMPETITION COMMISSION Applicant and NUTANIX HONG KONG LIMITED 1 st Respondent BT HONG KONG LIMITED 2 nd Respondent SIS INTERNATIONAL LIMITED 3 rd Respondent INNOVIX DISTRIBUTION LIMITED (trading as “INNOVIX DISTRIBUTION”) 4 th Respondent TECH-21 SYSTEMS LIMITED 5 th Respondent", "representation": "Mr Mark Hoskins QC, Mr Peter Duncan SC and Ms Catrina Lam, instructed by Winston & Strawn, for the Applicant Mr Matthew Gearing (Solicitor Advocate), instructed by Latham & Watkins, for the 1 st Respondent Mr Charles Hollander and Mr Law Man-chung, instructed by Baker McKenzie, for the 2 nd Respondent Mr Gerard McCoy SC and Mr Timothy Parker, instructed by Norton Rose Fulbright, for the 3 rd Respondent Mr Paul Shieh SC, Ms Eva Sit and Mr Joshua Chan, instructed by Linklaters, for the 4 th Respondent Ms Cindy Kong, instructed by Fongs, for the 5 th Respondent"}
{"raw_case_num": "2022_HKCT_2", "date": "2022-07-22T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2022] HKCT 2", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2018/CTEA000001B_2018.docx", "cases_title": "COMPETITION COMMISSION V. KAM KWONG ENGINEERING COMPANY LTD AND OTHERS", "cases_act": "CTEA1/2018", "date_in_content": "Dates of Hearing: 24 September 2020 Date of Decision: 22 July 2022", "coram": "Before: Hon Harris J in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and KAM KWONG ENGINEERING COMPANY LTD 1 st Respondent (金光工程有限公司) GOLDFIELD N&W CONSTRUCTION 2 nd Respondent COMPANY LTD (聯合金輝建築工程有限公司) PACIFIC VIEW ENGINEERING LTD 3 rd Respondent (豪景工程有限公司) CHAN KAM SHUI (陳金水) 4 th Respondent LAM PO WONG (林保旺) 5 th Respondent", "representation": "Mr Abraham Chan SC and Mr Issac Chan, instructed by King & Wood Mallesons, for the applicant Mr Matthew Ngai and Ms Mandy Chan, instructed by Dundons, for the 3 rd and 5 th respondents"}
{"raw_case_num": "2021_HKCT_2", "date": "2021-10-12T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2021] HKCT 2", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2018/CTA000001D_2018.docx", "cases_title": "TACHING PETROLEUM CO LTD V. MEYER ALUMINIUM LTD", "cases_act": "CTA1/2018", "date_in_content": "Dates of Hearing: 27-30 July, 2, 3 and 9 August 2021 Date of Judgment: 12 October 2021", "coram": "Before: Hon Au-Yeung J, Deputy President", "parties": "BETWEEN TACHING PETROLEUM COMPANY LIMITED Plaintiff and MEYER ALUMINIUM LIMITED Defendant ____________", "representation": "Ms Catrina Lam and Ms Cherry Xu, instructed by Herbert Tsoi & Partners, for Taching, the plaintiff in CTA 1/2018 Ms Eva Sit, SC and Mr Joshua Chan, instructed by Clifford Chance, for Shell, the plaintiff in CTA 2/2018 Mr Kenneth K H Lee, Ms Nana Lui and Mr William Tse, instructed by Robertsons, for Meyer, the defendant in both cases"}
{"raw_case_num": "2022_HKCT_1", "date": "2022-07-22T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2022] HKCT 1", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2018/CTEA000001A_2018.docx", "cases_title": "COMPETITION COMMISSION V. KAM KWONG ENGINEERING COMPANY LTD AND OTHERS", "cases_act": "CTEA1/2018", "date_in_content": "Dates of Hearing: 7 August 2020 Date of Decision: 22 July 2022", "coram": "Before: Hon Harris J in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and KAM KWONG ENGINEERING COMPANY LTD 1 st Respondent (金光工程有限公司) GOLDFIELD N&W CONSTRUCTION 2 nd Respondent COMPANY LTD (聯合金輝建築工程有限公司) PACIFIC VIEW ENGINEERING LTD 3 rd Respondent (豪景工程有限公司) CHAN KAM SHUI (陳金水) 4 th Respondent LAM PO WONG (林保旺) 5 th Respondent", "representation": "Mr Abraham Chan SC and Mr Issac Chan, instructed by King & Wood Mallesons, for the applicant Mr Michael Lok and Ms Sharon Yuen, instructed by Chow & Partners, for the 2 nd respondent The 4 th respondent appeared in person The 1 st respondent was not represented and did not appear Attendance of Dundons, for the 3 rd and 5 th respondents, was excused"}
{"raw_case_num": "2022_HKCT_3", "date": "2022-08-04T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2022] HKCT 3", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2022/CTEA000001_2022.docx", "cases_title": "COMPETITION COMMISSION V. GRAY LINE TOURS OF HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2022", "date_in_content": "Date of Hearing:  21 July 2022 Date of Decision:  21 July 2022 Date of Reasons for Decision:  4 August 2022", "coram": "Before:  Hon Harris J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and GRAY LINE TOURS OF HONG KONG LIMITED 1 st Respondent HARBOUR PLAZA 8 DEGREES LIMITED 2 nd Respondent HARBOUR PLAZA HOTEL MANAGEMENT LIMITED 3 rd Respondent PRUDENTIAL HOTEL (BVI) LIMITED 4 th Respondent TAK HOW INVESTMENT LIMITED (TRADING AS INTERCONTINENTAL GRAND STANFORD HONG KONG) 5 th Respondent WU SIU IENG MICHAEL 6 th Respondent", "representation": "Mr Julian Lam, instructed by Pinsent Masons, for the applicant Mr Timothy Parker, instructed by Norton Rose Fulbright Hong Kong, for the 2 nd and 3 rd respondents Mr Nigel Francis, of YTL LLP, for the 4 th respondent Attendance of Johnny K K Leung & Co, for the 1 st and 6 th respondents, was excused Attendance of Deacons, for the 5 th respondent, was excused"}
{"raw_case_num": "2023_HKCT_2", "date": "2023-06-14T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2023] HKCT 2", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2022/CTEA000001A_2022.docx", "cases_title": "COMPETITION COMMISSION V. GRAY LINE TOURS OF HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2022", "date_in_content": "Date of Hearing: 2 September 2022 Date of Decision: 14 June 2023", "coram": "Before: Hon Harris J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and GRAY LINE TOURS OF HONG KONG LIMITED 1 st Respondent HARBOUR PLAZA 8 DEGREES LIMITED 2 nd Respondent HARBOUR PLAZA HOTEL MANAGEMENT 3 rd Respondent LIMITED PRUDENTIAL HOTEL (BVI) LIMITED 4 th Respondent TAK HOW INVESTMENT LIMITED (TRADING 5 th Respondent AS INTERCONTINENTAL GRAND STANFORD HONG KONG) WU SIU IENG MICHAEL 6 th Respondent", "representation": "Mr Derek Chan SC and Ms Allison Wong, instructed by Pinsent Masons, for the applicant Mr Tony Ko, instructed by Johnny K K Leung & Co, for the 1 st and 6 th respondents Mr Timothy Parker, instructed by Norton Rose Fulbright Hong Kong, for the 2 nd and 3 rd respondents Mr Nigel Francis, instructed by YTL LLP, for the 4 th respondent Attendance of Deacons, for the 5 th respondent, was excused"}
{"raw_case_num": "2023_HKCT_3", "date": "2023-06-23T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2023] HKCT 3", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2022/CTEA000001B_2022.docx", "cases_title": "COMPETITION COMMISSION V. GRAY LINE TOURS OF HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2022", "date_in_content": "Date of Written Submissions: 10 March 2023 Date of Decision: 23 June 2023", "coram": "Before: Hon Harris J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and GRAY LINE TOURS OF HONG KONG LIMITED 1 st Respondent HARBOUR PLAZA 8 DEGREES LIMITED 2 nd Respondent HARBOUR PLAZA HOTEL MANAGEMENT 3 rd Respondent LIMITED PRUDENTIAL HOTEL (BVI) LIMITED 4 th Respondent TAK HOW INVESTMENT LIMITED (TRADING 5 th Respondent AS INTERCONTINENTAL GRAND STANFORD HONG KONG) WU SIU IENG MICHAEL 6 th Respondent", "representation": "Written Submissions by Mr Nigel Francis, instructed by YTL LLP, for the 4 th respondent"}
{"raw_case_num": "2022_HKCT_4", "date": "2022-08-31T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2022] HKCT 4", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2022/CTEA000002_2022.docx", "cases_title": "COMPETITION COMMISSION V. ATAL BUILDING SERVICES ENGINEERING LTD AND OTHERS", "cases_act": "CTEA2/2022", "date_in_content": "Dates of Hearing: 26 July 2022 Date of Decision: 31 August 2022", "coram": "Before: Hon Harris J, President of the Competition Tribunal in Chambers", "parties": "COMPETITION COMMISSION Applicant and ATAL BUILDING SERVICES ENGINEERING LIMITED 1st Respondent ANALOGUE HOLDINGS LIMITED 2nd Respondent SHUN HING ENGINEERING CONTRACTING COMPANY LIMITED 3rd Respondent SHUN HING HOLDINGS COMPANY LIMITED 4th Respondent SER KA WAI 5th Respondent CHENG KIT SHUN 6th Respondent KWAN SIU KIN 7th Respondent", "representation": "Mr Norman Nip SC and Ms Leticia Tang, instructed by Dentons Hong Kong LLP, for the applicant Mr Abraham Chan SC and Mr Joshua Chan, instructed by Deacons, for the 1 st and 2 nd respondents Ms Catrina Lam and Ms Tinny Chan, instructed by William Lam & Co, for the 3 rd , 4 th and 7 th respondents Mr Patrick Siu, instructed by Morley Chow Szeto, for the 5 th and 6 th respondents"}
{"raw_case_num": "2023_HKCT_1", "date": "2023-06-14T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2023] HKCT 1", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2021/CTEA000001_2021.docx", "cases_title": "COMPETITION COMMISSION V. QUADIENT TECHNOLOGIES HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2021", "date_in_content": "Date of Hearing: 2 September 2022 Date of Decision: 14 June 2023", "coram": "Before: Hon Harris J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and QUADIENT TECHNOLOGIES HONG KONG LIMITED 1 st Respondent QUADIENT INTERNATIONAL SUPPLY LIMITED 2 nd Respondent TOPPAN FORMS (HONG KONG) LIMITED 3 rd Respondent SMARTECH BUSINESS SYSTEMS (HONG KONG) LIMITED 4 th Respondent", "representation": "Mr Derek Chan SC and Ms Allison Wong, instructed by MinterEllison LLP, for the applicant Attendance of Hogan Lovells, for the 1 st and 2 nd respondents, was excused Attendance of Slaughter and May, for the 3 rd respondent, was excused Attendance of Stephenson Harwood, for the 4 th respondent, was excused"}
{"raw_case_num": "2023_HKCT_6", "date": "2023-07-26T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2023] HKCT 6", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2021/CTEA000001A_2021.docx", "cases_title": "COMPETITION COMMISSION V. QUADIENT TECHNOLOGIES HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2021", "date_in_content": "Date of Hearing: 2 September 2022 Date of Decision: 14 June 2023 Date of Reasons for Decision: 26 July 2023", "coram": "Before: Hon Harris J, President of the Competition Tribunal in Chambers", "parties": "COMPETITION COMMISSION Applicant and QUADIENT TECHNOLOGIES HONG KONG LIMITED 1st Respondent QUADIENT INTERNATIONAL SUPPLY LIMITED 2nd Respondent TOPPAN FORMS (HONG KONG) LIMITED 3rd Respondent SMARTECH BUSINESS SYSTEMS (HONG KONG) LIMITED 4th Respondent", "representation": "Mr Derek Chan SC and Ms Allison Wong, instructed by MinterEllison LLP, for the applicant Attendance of Hogan Lovells, for the 1 st and 2 nd respondents, was excused Attendance of Slaughter and May, for the 3 rd respondent, was excused Attendance of Stephenson Harwood, for the 4 th respondent, was excused"}
{"raw_case_num": "2023_HKCT_8", "date": "2023-08-02T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2023] HKCT 8", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2023/CTEA000001_2023.docx", "cases_title": "COMPETITION COMMISSION V. MULTISOFT LTD AND OTHERS", "cases_act": "CTEA1/2023", "date_in_content": "Date of Hearing: 2 August 2023 Date of Decision: 2 August 2023", "coram": "Before: Hon Harris J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and MULTISOFT LIMITED 1st Respondent MTT GROUP HOLDINGS LIMITED 2nd Respondent BP ENTERPRISE COMPANY LIMITED 3rd Respondent NOBLE NURSING HOME COMPANY LIMITED 4th Respondent KWEK STUDIO LIMITED 5th Respondent AU YEUNG KIT YEE 6th Respondent (trading as YAT YING HONG and in her personal capacity) FAN SING CHI 7th Respondent TANG WAI CHUN 8th Respondent", "representation": "Mr Jenkin Suen SC and Ms Tinny Chan, instructed by MinterEllison LLP, for the applicant Mr Cater Chim, instructed by Pauline Wong & Co., for the 1 st and 2 nd respondents Miss Annie Lai, instructed by Mandy Wan & Co., for the 3 rd and 4 th respondents Attendance of C Y Lam & Co, for the 5 th and 8 th respondents, was excused The 6 th respondent was not represented and did not appear The 7 th respondent was not represented and did not appear"}
{"raw_case_num": "2023_HKCT_9", "date": "2023-10-25T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2023] HKCT 9", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2023/CTEA000002_2023.docx", "cases_title": "COMPETITION COMMISSION V. ATAL BUILDING SERVICES ENGINEERING LTD AND OTHERS", "cases_act": "CTEA2/2023", "date_in_content": "Date of Hearing: 29 August 2023 Date of Decision: 25 October 2023", "coram": "Before: Hon Harris J, President of the Competition Tribunal in Chambers", "parties": "BETWEEN COMPETITION COMMISSION Applicant and ATAL BUILDING SERVICES ENGINEERING 1 st Respondent LIMITED JOHNSON CONTROLS HONG KONG LIMITED 2 nd Respondent YORK INTERNATIONAL (NORTHERN ASIA) 3 rd Respondent LIMITED JOHNSON CONTROLS INTERNATIONAL PLC 4 th Respondent LEE YUI MING 5 th Respondent", "representation": "Mr Norman Nip SC and Ms Leticia Tang, instructed by Dentons Hong Kong LLP, for the applicant Mr Peter So, of Deacons, for the 1 st respondent Mr Paul Shieh SC and Mr Jonathan Ng, instructed by Baker & McKenzie for the 2 nd to 4 th respondents Mr Stephen Crosswell, solicitor advocate, of Baker & McKenzie, for the 2 nd to 4 th respondents The 5 th respondent was not represented and did not appear"}
{"raw_case_num": "2023_HKCT_7", "date": "2023-07-26T00:00:00+08:00", "db": "Competition Tribunal", "neutral_cit": "[2023] HKCT 7", "doc": "https://legalref.judiciary.hk/doc/judg/word/vetted/other/en/2022/CTEA000001C_2022.docx", "cases_title": "COMPETITION COMMISSION V. GRAY LINE TOURS OF HONG KONG LTD AND OTHERS", "cases_act": "CTEA1/2022", "date_in_content": "Date of Hearing: 2 September 2022 Date of Decision: 14 June 2023 Date of Reasons for Decision: 26 July 2023", "coram": "Before: Hon Harris J, President of the Competition Tribunal in Chambers", "parties": "COMPETITION COMMISSION Applicant and GRAY LINE TOURS OF HONG KONG LIMITED 1st Respondent HARBOUR PLAZA 8 DEGREES LIMITED 2nd Respondent HARBOUR PLAZA HOTEL MANAGEMENT LIMITED 3rd Respondent PRUDENTIAL HOTEL (BVI) LIMITED 4th Respondent TAK HOW INVESTMENT LIMITED (TRADING AS INTERCONTINENTAL GRAND STANFORD HONG KONG) 5th Respondent WU SIU IENG MICHAEL 6th Respondent", "representation": "Mr Derek Chan SC and Ms Allison Wong, instructed by Pinsent Masons, for the applicant Mr Tony Ko, instructed by Johnny K K Leung & Co, for the 1 st and 6 th respondents Mr Timothy Parker, instructed by Norton Rose Fulbright Hong Kong, for the 2 nd and 3 rd respondents Mr Nigel Francis, instructed by YTL LLP, for the 4 th respondent Attendance of Deacons, for the 5 th respondent, was excused"}
